/* errSecAllocate */
"KEYCHAIN_ERR_SEC_ALLOCATE" = "Failed to allocate memory.";

/* errSecAuthFailed */
"KEYCHAIN_ERR_SEC_AUTH_FAILED" = "The user name or passphrase you entered is not correct.";

/* errSecDecode */
"KEYCHAIN_ERR_SEC_DECODE" = "Unable to decode the provided data.";

/* default keychain error */
"KEYCHAIN_ERR_SEC_DEFAULT" = "Refer to <Security/SecBase.h> for description";

/* errSecDuplicateItem */
"KEYCHAIN_ERR_SEC_DUPLICATE_ITEM" = "The specified item already exists in the keychain.";

/* errSecInteractionNotAllowed */
"KEYCHAIN_ERR_SEC_ITEM_NOT_ALLOWED" = "User interaction is not allowed.";

/* errSecItemNotFound */
"KEYCHAIN_ERR_SEC_ITEM_NOT_FOUND" = "The specified item could not be found in the keychain.";

/* errSecNotAvailable */
"KEYCHAIN_ERR_SEC_NOT_AVAILABLE" = "No keychain is available. You may need to restart your computer.";

/* errSecParam */
"KEYCHAIN_ERR_SEC_PARAM" = "One or more parameters passed to a function where not valid.";

/* errSecUnimplemented */
"KEYCHAIN_ERR_SEC_UNIMPLEMENTED" = "Function or operation not implemented.";

